@elXaptation  I repo this bug with latest code on `feature/google-service` branch.



Code:
```
terraform {
  required_providers {
    packetfabric = {
      # source  = "PacketFabric/packetfabric"
      # version = "0.2.0"
      source  = "terraform.local/PacketFabric/packetfabric"
      version = "~> 0.0.0"
    }
  }
}

provider "packetfabric" {
  host  = var.pf_api_server
  token = var.pf_api_key
}

# Create random name to use to name objects
resource "random_pet" "name" {}

# Create a PacketFabric interfaces
resource "packetfabric_interface" "port_1" {
  provider          = packetfabric
  account_uuid      = var.pf_account_uuid
  autoneg           = var.pf_interface_autoneg
  description       = "${var.tag_name}-${random_pet.name.id}"
  media             = var.pf_interface_media
  nni               = var.pf_interface_nni
  pop               = var.pf_interface_pop1
  speed             = var.pf_interface_speed
  subscription_term = var.pf_interface_subterm
  zone              = var.pf_interface_avzone1
}
output "packetfabric_port_1" {
  value = packetfabric_interface.port_1
}
resource "packetfabric_interface" "port_2" {
  provider          = packetfabric
  account_uuid      = var.pf_account_uuid
  autoneg           = var.pf_interface_autoneg
  description       = "${var.tag_name}-${random_pet.name.id}"
  media             = var.pf_interface_media
  nni               = var.pf_interface_nni
  pop               = var.pf_interface_pop2
  speed             = var.pf_interface_speed
  subscription_term = var.pf_interface_subterm
  zone              = var.pf_interface_avzone2
}
output "packetfabric_port_2" {
  value = packetfabric_interface.port_2
}

# Get billing information related to the interface created
data "packetfabric_billing" "port_1" {
  provider = packetfabric
  circuit_id = packetfabric_interface.port_1.id
  depends_on = [
    packetfabric_interface.port_1
  ]
}
output "packetfabric_billing_port_1" {
  value = data.packetfabric_billing.port_1
}
data "packetfabric_billing" "port_2" {
  provider = packetfabric
  circuit_id = packetfabric_interface.port_2.id
  depends_on = [
    packetfabric_interface.port_2
  ]
}
output "packetfabric_billing_port_2" {
  value = data.packetfabric_billing.port_2
}

# Create backbone Virtual Circuit
resource "packetfabric_backbone_virtual_circuit" "vc1" {
  provider = packetfabric
  description = "${var.tag_name}-${random_pet.name.id}"
  epl =  false
  interface_a {
    port_circuit_id = packetfabric_interface.port_1.id
    untagged = false
    vlan = var.pf_vc_vlan1
  }
  interface_z {
    port_circuit_id = packetfabric_interface.port_2.id
    untagged = false
    vlan = var.pf_vc_vlan2  
  }
  bandwidth {
    account_uuid = var.pf_account_uuid
    longhaul_type = var.pf_vc_longhaul_type
    speed = var.pf_vc_speed
    subscription_term = var.pf_vc_subterm
  }
}

# Get PacketFabric locations
data "packetfabric_locations" "location_1" {
  provider = packetfabric
  # filter {
  #   pop = var.pf_interface_pop1
  # }
}
data "packetfabric_locations" "location_2" {
  provider = packetfabric
  # filter {
  #   pop = var.pf_interface_pop2
  # }
}

# Create Cross Connect
resource "packetfabric_outbound_cross_connect" "crossconnect_1" {
  provider = packetfabric
  description = "${var.tag_name}-${random_pet.name.id}"
  document_uuid = var.pf_document_uuid1
  port = packetfabric_interface.port_1.id
  site = var.pf_interface_site1
  # https://github.com/PacketFabric/terraform-provider-packetfabric/issues/63
  #site = data.packetfabric_locations.location_1.site_code
}
output "packetfabric_outbound_cross_connect1" {
  value = packetfabric_outbound_cross_connect.crossconnect_1
}
resource "packetfabric_outbound_cross_connect" "crossconnect_2" {
  provider = packetfabric
  description = "${var.tag_name}-${random_pet.name.id}"
  document_uuid = var.pf_document_uuid2
  port = packetfabric_interface.port_1.id
  site = var.pf_interface_site2
  # https://github.com/PacketFabric/terraform-provider-packetfabric/issues/63
  #site = data.packetfabric_locations.location_2.site_code
}
output "packetfabric_outbound_cross_connect2" {
  value = packetfabric_outbound_cross_connect.crossconnect_2
}
```

Output
```
data.packetfabric_locations.location_2: Reading...
data.packetfabric_locations.location_1: Reading...
data.packetfabric_locations.location_2: Read complete after 1s [id=57844e70-423f-4cc7-9e2c-966e8a279856]
data.packetfabric_locations.location_1: Read complete after 1s [id=4c0e0e3b-0a2b-4a5e-8b7d-b646b7c87470]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.packetfabric_billing.port_1 will be read during apply
  # (config refers to values not yet known)
 <= data "packetfabric_billing" "port_1" {
      + billings   = (known after apply)
      + circuit_id = (known after apply)
      + id         = (known after apply)
    }

  # data.packetfabric_billing.port_2 will be read during apply
  # (config refers to values not yet known)
 <= data "packetfabric_billing" "port_2" {
      + billings   = (known after apply)
      + circuit_id = (known after apply)
      + id         = (known after apply)
    }

  # packetfabric_backbone_virtual_circuit.vc1 will be created
  + resource "packetfabric_backbone_virtual_circuit" "vc1" {
      + description = (known after apply)
      + epl         = false
      + id          = (known after apply)

      + bandwidth {
          + account_uuid      = "24a0aef3-2784-48dc-9a8e-52d44d6da646"
          + longhaul_type     = "dedicated"
          + speed             = "200Mbps"
          + subscription_term = 1
        }

      + interface_a {
          + port_circuit_id = (known after apply)
          + untagged        = false
          + vlan            = 4
        }

      + interface_z {
          + port_circuit_id = (known after apply)
          + untagged        = false
          + vlan            = 5
        }
    }

  # packetfabric_interface.port_1 will be created
  + resource "packetfabric_interface" "port_1" {
      + account_uuid      = "24a0aef3-2784-48dc-9a8e-52d44d6da646"
      + autoneg           = false
      + description       = (known after apply)
      + id                = (known after apply)
      + media             = "LX"
      + nni               = false
      + pop               = "PDX1"
      + speed             = "1Gbps"
      + subscription_term = 1
      + zone              = "A"
    }

  # packetfabric_interface.port_2 will be created
  + resource "packetfabric_interface" "port_2" {
      + account_uuid      = "24a0aef3-2784-48dc-9a8e-52d44d6da646"
      + autoneg           = false
      + description       = (known after apply)
      + id                = (known after apply)
      + media             = "LX"
      + nni               = false
      + pop               = "WDC1"
      + speed             = "1Gbps"
      + subscription_term = 1
      + zone              = "E"
    }

  # packetfabric_outbound_cross_connect.crossconnect_1 will be created
  + resource "packetfabric_outbound_cross_connect" "crossconnect_1" {
      + description   = (known after apply)
      + document_uuid = "1d2fb159-b40e-4eda-8f63-1191a80a023e"
      + id            = (known after apply)
      + port          = (known after apply)
      + site          = "PN-PIT"
    }

  # packetfabric_outbound_cross_connect.crossconnect_2 will be created
  + resource "packetfabric_outbound_cross_connect" "crossconnect_2" {
      + description   = (known after apply)
      + document_uuid = "1d2fb159-b40e-4eda-8f63-1191a80a023e"
      + id            = (known after apply)
      + port          = (known after apply)
      + site          = "EQ-DC5"
    }

  # random_pet.name will be created
  + resource "random_pet" "name" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + packetfabric_billing_port_1          = {
      + billings   = (known after apply)
      + circuit_id = (known after apply)
      + id         = (known after apply)
    }
  + packetfabric_billing_port_2          = {
      + billings   = (known after apply)
      + circuit_id = (known after apply)
      + id         = (known after apply)
    }
  + packetfabric_outbound_cross_connect1 = {
      + data_center_cross_connect_id = null
      + description                  = (known after apply)
      + destination_circuit_id       = null
      + destination_name             = null
      + document_uuid                = "1d2fb159-b40e-4eda-8f63-1191a80a023e"
      + id                           = (known after apply)
      + module                       = null
      + panel                        = null
      + port                         = (known after apply)
      + position                     = null
      + published_quote_line_uuid    = null
      + site                         = "PN-PIT"
      + timeouts                     = null
      + user_description             = null
    }
  + packetfabric_outbound_cross_connect2 = {
      + data_center_cross_connect_id = null
      + description                  = (known after apply)
      + destination_circuit_id       = null
      + destination_name             = null
      + document_uuid                = "1d2fb159-b40e-4eda-8f63-1191a80a023e"
      + id                           = (known after apply)
      + module                       = null
      + panel                        = null
      + port                         = (known after apply)
      + position                     = null
      + published_quote_line_uuid    = null
      + site                         = "EQ-DC5"
      + timeouts                     = null
      + user_description             = null
    }
  + packetfabric_port_1                  = {
      + account_uuid      = "24a0aef3-2784-48dc-9a8e-52d44d6da646"
      + autoneg           = false
      + description       = (known after apply)
      + id                = (known after apply)
      + media             = "LX"
      + nni               = false
      + pop               = "PDX1"
      + speed             = "1Gbps"
      + subscription_term = 1
      + timeouts          = null
      + zone              = "A"
    }
  + packetfabric_port_2                  = {
      + account_uuid      = "24a0aef3-2784-48dc-9a8e-52d44d6da646"
      + autoneg           = false
      + description       = (known after apply)
      + id                = (known after apply)
      + media             = "LX"
      + nni               = false
      + pop               = "WDC1"
      + speed             = "1Gbps"
      + subscription_term = 1
      + timeouts          = null
      + zone              = "E"
    }
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "pf_aws_account_id" but a value was found in file "secret.tfvars". If you
│ meant to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations
│ in your organization. To reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "compartment_id" but a value was found in file "secret.tfvars". If you
│ meant to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations
│ in your organization. To reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 17 other variable(s) defined without being declared.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_pet.name: Creating...
random_pet.name: Creation complete after 0s [id=suited-vulture]
packetfabric_interface.port_1: Creating...
packetfabric_interface.port_2: Creating...
packetfabric_interface.port_1: Still creating... [10s elapsed]
packetfabric_interface.port_2: Still creating... [10s elapsed]
packetfabric_interface.port_1: Still creating... [20s elapsed]
packetfabric_interface.port_2: Still creating... [20s elapsed]
packetfabric_interface.port_1: Still creating... [30s elapsed]
packetfabric_interface.port_2: Still creating... [30s elapsed]
packetfabric_interface.port_1: Creation complete after 37s [id=PF-AP-PDX1-1743687]
data.packetfabric_billing.port_1: Reading...
packetfabric_outbound_cross_connect.crossconnect_2: Creating...
packetfabric_outbound_cross_connect.crossconnect_1: Creating...
data.packetfabric_billing.port_1: Read complete after 0s [id=dce0d18a-0bb5-4080-89c2-df983349a5fc]
packetfabric_interface.port_2: Still creating... [40s elapsed]
packetfabric_interface.port_2: Creation complete after 42s [id=PF-AP-WDC1-1743686]
data.packetfabric_billing.port_2: Reading...
packetfabric_backbone_virtual_circuit.vc1: Creating...
data.packetfabric_billing.port_2: Read complete after 0s [id=e861abc5-e1c7-4b35-bf7d-f4535869b0ce]
╷
│ Warning: Outbound Cross Connect Create
│ 
│   with packetfabric_outbound_cross_connect.crossconnect_1,
│   on main.tf line 112, in resource "packetfabric_outbound_cross_connect" "crossconnect_1":
│  112: resource "packetfabric_outbound_cross_connect" "crossconnect_1" {
│ 
│ Outbound Cross Connect is being created
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to packetfabric_outbound_cross_connect.crossconnect_1, provider
│ "provider[\"terraform.local/packetfabric/packetfabric\"]" produced an unexpected new value: Root resource was present, but
│ now absent.
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to packetfabric_outbound_cross_connect.crossconnect_2, provider
│ "provider[\"terraform.local/packetfabric/packetfabric\"]" produced an unexpected new value: Root resource was present, but
│ now absent.
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Status: 400, body: {"message": "These ports are not active: ['PF-AP-WDC1-1743686']", "request_id": "39869434-df08-446a-9809-6a5415525401"}
│ 
│   with packetfabric_backbone_virtual_circuit.vc1,
│   on main.tf line 75, in resource "packetfabric_backbone_virtual_circuit" "vc1":
│   75: resource "packetfabric_backbone_virtual_circuit" "vc1" {
│ 
╵
```